# FaceSilhouetteNode Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceSilhouetteNode Members
FaceSilhouetteNode Class Methods Properties See Also
---
The FaceSilhouetteNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RenderNode.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetFace | Returns the Face object corresponding to the node. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetInstanceTransform | Returns instance transform of the object being drawn.  (Inherited from FaceDetailNode.) |
| GetLinkTransform | Returns link transform of the object being drawn.  (Inherited from FaceDetailNode.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RenderNode.) |
| LineProperties | Access to the line (pen) properties of the curve being drawn.  (Inherited from FaceDetailNode.) |
| NodeName | A readable name of the output node.  (Inherited from RenderNode.) |

# See Also
FaceSilhouetteNode Class
Autodesk.Revit.DB Namespace